In [2]:
%reload_ext sql
%sql postgresql+psycopg2://postgres:postgres@localhost/demo

In [3]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [3]:
%%sql
create table employees(
    id integer PRIMARY KEY,
    first_name text not null,
    last_name text not null,
    age integer,
    salary decimal(10,2)
);

 * postgresql+psycopg2://postgres:***@localhost/demo
(psycopg2.errors.DuplicateTable) relation "employees" already exists

[SQL: create table employees(
    id integer PRIMARY KEY,
    first_name text not null,
    last_name text not null,
    age integer,
    salary decimal(10,2)
);]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [ ]:
-- ctas create table as
-- store result query output as table
%%sql
create table high_paid_employee as
select 
    id,
    first_name,
    last_name,
    age,
    salary
from employees
where salary > 50000;

In [ ]:
-- temporary table
-- session scoped temporary table
%%sql
create temporary table temp_high_paid_employee(

    id integer,
    salary decimal(10,2)
);

insert into temp_high_paid_employee
select 
    id,
    salary
from employees
where salary > 60000;

In [ ]:
-- cte
-- this is useful if we need the subqueries in multiple places.
%%sql
create table hpe_cte as
with high_paid_employee_cte as(
    select
        id,
        first_name,
        last_name,
        salary
    from employees
    where salary >= 60000
)

select * from high_paid_employee_cte;

In [ ]:
%%sql
create table demo1(
    id integer primary key,
    name text,
    update_time timestamp default now()
);

insert into demo1(id, name)
values(1, 'Ruba'),
(2, 'Ramanan');

insert into demo1(id, name, update_time)
values(3, 'Thayalan', '2025-03-05 11:02:43.960877');

In [ ]:
%%sql
drop table if exists Employees;
CREATE TABLE Employees (
    EmployeeID INT,
    Name VARCHAR(100),
    Department VARCHAR(50),
    HireDate DATE
)

INSERT INTO Employees (EmployeeID, Name, Department, HireDate)
VALUES
    (1, 'Alice', 'HR', '2020-05-01'),
    (1, 'Alice', 'HR', '2022-06-15'),
    (2, 'Bob', 'IT', '2021-07-10'),
    (3, 'Charlie', 'Finance', '2020-09-30'),
    (3, 'Charlie', 'Finance', '2022-05-22');

In [ ]:
%%sql
create table students(
    name text,
    score int
)

insert into students(name,score)
values('Ruba',22),
('Thaya', 22),
('Rama',28),
('Ruban', 28),
('Nithy', 10),
('karthi', 35)

In [4]:
%%sql
CREATE TABLE EmployeeSales (
    EmployeeID INT,
    EmployeeName VARCHAR(100),
    SalesAmount DECIMAL(10, 2)
);


INSERT INTO EmployeeSales (EmployeeID, EmployeeName, SalesAmount) VALUES
(1, 'Alice', 10000),
(2, 'Bob', 8500),
(3, 'Charlie', 7500),
(4, 'David', 6000),
(5, 'Eva', 11000),
(6, 'Frank', 4500),
(7, 'Grace', 3000),
(8, 'Hank', 4000),
(9, 'Ivy', 8000),
(10, 'Jack', 9500);

 * postgresql+psycopg2://postgres:***@localhost/demo
Done.
10 rows affected.

[]

In [5]:
%%sql
drop table if exists EmployeeSalaries;
CREATE TABLE EmployeeSalaries (
    EmployeeID INT,
    EmployeeName VARCHAR(100),
    Salary DECIMAL(10, 2),
    Year INT
);
INSERT INTO EmployeeSalaries (EmployeeID, EmployeeName, Salary, Year) VALUES
(1, 'Alice', 5000, 2023),
(1, 'Alice', 5500, 2024),
(2, 'Bob', 4500, 2023),
(2, 'Bob', 4800, 2024),
(3, 'Charlie', 4000, 2023),
(3, 'Charlie', 4200, 2024),
(4, 'David', 4600, 2023),
(4, 'David', 4700, 2024),
(5, 'Eva', 5200, 2023),
(5, 'Eva', 5400, 2024);

 * postgresql+psycopg2://postgres:***@localhost/demo
Done.
Done.
10 rows affected.

[]

In [6]:
%%sql
CREATE TABLE SalesData (
    SaleID INT,
    EmployeeName VARCHAR(100),
    SaleAmount DECIMAL(10, 2),
    SaleDate DATE
);
INSERT INTO SalesData (SaleID, EmployeeName, SaleAmount, SaleDate) VALUES
(1, 'Alice', 5000, '2025-01-01'),
(2, 'Bob', 3000, '2025-01-02'),
(3, 'Charlie', 4000, '2025-01-03'),
(4, 'David', 4500, '2025-01-04'),
(5, 'Eva', 5500, '2025-01-05');

 * postgresql+psycopg2://postgres:***@localhost/demo
Done.
5 rows affected.

[]

In [7]:
%%sql
drop table if exists EmployeeSalaries;
CREATE TABLE EmployeeSalaries (
    EmployeeID INT,
    EmployeeName VARCHAR(100),
    Salary DECIMAL(10, 2),
    Year INT
);
INSERT INTO EmployeeSalaries (EmployeeID, EmployeeName, Salary, Year) VALUES
(1, 'Alice', 5000, 2021),
(1, 'Alice', 5500, 2022),
(1, 'Alice', 6000, 2023),
(1, 'Alice', 6500, 2024),
(1, 'Alice', 7000, 2025),
(2, 'Bob', 4500, 2023),
(2, 'Bob', 4800, 2024),
(3, 'Charlie', 4000, 2023),
(3, 'Charlie', 4200, 2024),
(4, 'David', 4600, 2023),
(4, 'David', 4700, 2024),
(5, 'Eva', 5200, 2023),
(5, 'Eva', 5400, 2024);

 * postgresql+psycopg2://postgres:***@localhost/demo
Done.
Done.
13 rows affected.

[]